<?php
return [

    /*
    |--------------------------------------------------------------------------
    | Zarinpal Mode
    |--------------------------------------------------------------------------
    | sandbox     => حالت تست
    | production  => حالت واقعی
    */
    'mode' => 'production',

    /*
    |--------------------------------------------------------------------------
    | Merchant ID
    |--------------------------------------------------------------------------
    | این مقدار رو از پنل زرین‌پال می‌گیری
    | در حالت sandbox می‌تونی فعلاً همون تستی بذاری
    */
    'merchant_id' => '586a9cbf-3f4c-4e1f-847f-17ac2ddb8374',

    /*
    |--------------------------------------------------------------------------
    | Callback URL
    |--------------------------------------------------------------------------
    | بعد از پرداخت، زرین‌پال کاربر رو به این آدرس برمی‌گردونه
    | این فایل رو در مرحله verify می‌سازیم
    */
    'callback_url' => 'https://aminindpharm.ir/api/cart/payment/verify-payment.php',

    /*
    |--------------------------------------------------------------------------
    | Payment Description (Optional)
    |--------------------------------------------------------------------------
    */
    'description' => 'پرداخت سفارش از فروشگاه AminindPharm',

    /*
    |--------------------------------------------------------------------------
    | Currency
    |--------------------------------------------------------------------------
    | IRR = ریال
    | IRT = تومان (زرین‌پال خودش ×10 می‌کند)
    */
    'currency' => 'IRR',
];
